Documents/А_ПередачаНачисленийМеждуПодразделениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>А_ПередачаНачисленийМеждуПодразделениями</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПрочиеАктивыПассивы</xr:Item>
				<xr:Item>AccumulationRegister.А_ВзаиморасчетыССотрудниками</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_ДокументОснование</Name>
					<Type>
						<v8:Type>d5p1:DocumentRef.ОтражениеЗарплатыВФинансовомУчете</v8:Type>
						<v8:Type>d5p1:DocumentRef.А_ОтражениеЗПпоКазне</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>d5p1:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияБухгалтерия</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходноеПодразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеПодразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокОснованиеСтроки</Name>
							<Type>
								<v8:Type>d5p1:DocumentRef.НачислениеЗарплаты</v8:Type>
								<v8:Type>d5p1:DocumentRef.ОтражениеЗарплатыВФинансовомУчете</v8:Type>
								<v8:Type>d5p1:DocumentRef.А_ОтражениеЗПпоКазне</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Налоги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияБухгалтерия</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходноеПодразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеПодразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНалога</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.ТипыНалогов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Налог</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Налоги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодДохода</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.ВидыДоходовНДФЛ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокОснованиеСтроки</Name>
							<Type>
								<v8:Type>d5p1:DocumentRef.НачислениеЗарплаты</v8:Type>
								<v8:Type>d5p1:DocumentRef.ОтражениеЗарплатыВФинансовомУчете</v8:Type>
								<v8:Type>d5p1:DocumentRef.А_ОтражениеЗПпоКазне</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Удержания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОрганизацияБухгалтерия</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходноеПодразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевоеПодразделение</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>d5p1:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодВзаиморасчетов</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокОснованиеСтроки</Name>
							<Type>
								<v8:Type>d5p1:DocumentRef.НачислениеЗарплаты</v8:Type>
								<v8:Type>d5p1:DocumentRef.ОтражениеЗарплатыВФинансовомУчете</v8:Type>
								<v8:Type>d5p1:DocumentRef.А_ОтражениеЗПпоКазне</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ПрочиеАктивыПассивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ПрочиеАктивыПассивы</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РасчетСебестоимости</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидИсточника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыИсточниковДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиУправленческогоБаланса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИсточникДвижений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УдалитьИсточникиДвижений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СтатьиАктивовПассивов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналитика</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/А_ВзаиморасчетыССотрудниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>А_ВзаиморасчетыССотрудниками</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаPL</Name>
					<Type>
						<v8:Type>cfg:EnumRef.А_ФормыPL</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОрганизацияБухгалтерия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/А_ПередачаНачисленийМеждуПодразделениями/Ext/ObjectModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

// Пишет движения в РегистрНакопления.ПрочиеАктивыПассивы (3 статьи обязательств) и
// РегистрНакопления.А_ВзаиморасчетыССотрудниками (только Оплата труда, разрез ФизическоеЛицо).
//
// Принцип «реверс на исходном / копия на целевом»: для пассивной статьи начисление ОЗФУ —
// Расход, поэтому на ИсходномПодразделении пишем Приход (гасим обязательство там, где его
// больше не платят), на ЦелевомПодразделении — Расход (ставим там, где касса юр.лица платит).
// Каждая строка net-zero по организации; Σ КО не меняется, баланс сдвигается между подр.
//
// Источник/ВидИсточника = ПустаяСсылка (как у ОЗФУ для Оплата труда/Налоги/Прочие пассивы).
// Для статьи «Налоги» Аналитика = ТипНалога (Перечисление.ТипыНалогов), для остальных — пусто.
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СтОТ      = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НайтиПоНаименованию("Оплата труда");
	СтНалоги  = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НайтиПоНаименованию("Налоги");
	СтПрочПас = ПланыВидовХарактеристик.СтатьиАктивовПассивов.НайтиПоНаименованию("Прочие пассивы");
	Если НЕ ЗначениеЗаполнено(СтОТ) ИЛИ НЕ ЗначениеЗаполнено(СтНалоги) ИЛИ НЕ ЗначениеЗаполнено(СтПрочПас) Тогда
		Отказ = Истина;
		Сообщить("ПНМП: не найдены статьи активов/пассивов (Оплата труда / Налоги / Прочие пассивы).");
		Возврат;
	КонецЕсли;

	Движения.ПрочиеАктивыПассивы.Записывать = Истина;
	Движения.ПрочиеАктивыПассивы.Очистить();

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("СтОТ", СтОТ);
	Запрос.УстановитьПараметр("СтНалоги", СтНалоги);
	Запрос.УстановитьПараметр("СтПрочПас", СтПрочПас);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&СтОТ КАК Статья,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка) КАК ТипНалога,
	|	Н.ИсходноеПодразделение КАК Исходное,
	|	Н.ЦелевоеПодразделение КАК Целевое,
	|	СУММА(Н.Сумма) КАК Сумма
	|ИЗ
	|	Документ.А_ПередачаНачисленийМеждуПодразделениями.Начисления КАК Н
	|ГДЕ
	|	Н.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Н.ИсходноеПодразделение, Н.ЦелевоеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&СтНалоги,
	|	Нл.ТипНалога,
	|	Нл.ИсходноеПодразделение,
	|	Нл.ЦелевоеПодразделение,
	|	СУММА(Нл.Сумма)
	|ИЗ
	|	Документ.А_ПередачаНачисленийМеждуПодразделениями.Налоги КАК Нл
	|ГДЕ
	|	Нл.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	Нл.ТипНалога, Нл.ИсходноеПодразделение, Нл.ЦелевоеПодразделение
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&СтПрочПас,
	|	ЗНАЧЕНИЕ(Перечисление.ТипыНалогов.ПустаяСсылка),
	|	У.ИсходноеПодразделение,
	|	У.ЦелевоеПодразделение,
	|	СУММА(У.Сумма)
	|ИЗ
	|	Документ.А_ПередачаНачисленийМеждуПодразделениями.Удержания КАК У
	|ГДЕ
	|	У.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	У.ИсходноеПодразделение, У.ЦелевоеПодразделение";

	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Сумма = 0 ИЛИ НЕ ЗначениеЗаполнено(Выборка.Исходное) ИЛИ НЕ ЗначениеЗаполнено(Выборка.Целевое) Тогда
			Продолжить;
		КонецЕсли;
		Сум = ?(Выборка.Сумма > 0, Выборка.Сумма, -Выборка.Сумма);
		// Пассивная статья: реверс на исходном (Приход) / копия на целевом (Расход) для положит. суммы
		Если Выборка.Сумма > 0 Тогда
			ВидДвИсх = ВидДвиженияНакопления.Приход;
			ВидДвЦел = ВидДвиженияНакопления.Расход;
		Иначе
			ВидДвИсх = ВидДвиженияНакопления.Расход;
			ВидДвЦел = ВидДвиженияНакопления.Приход;
		КонецЕсли;
		_ПАП_ДобавитьДвижение(Выборка.Статья, Выборка.ТипНалога, Выборка.Исходное, ВидДвИсх, Сум);
		_ПАП_ДобавитьДвижение(Выборка.Статья, Выборка.ТипНалога, Выборка.Целевое, ВидДвЦел, Сум);
	КонецЦикла;

	// Движения А_ВзаиморасчетыССотрудниками (инверсно ПАП(Оплата труда), разрез ФизическоеЛицо)
	РегистрыНакопления.А_ВзаиморасчетыССотрудниками.ЗаполнитьИзПередачиНачислений(ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Добавляет одну запись движения ПрочиеАктивыПассивы. Аналитика заполняется только если
// передан непустой ТипНалога (для статьи «Налоги»); иначе остаётся пустой (ОТ / Прочие пассивы).
Процедура _ПАП_ДобавитьДвижение(Статья, ТипНалога, Подразделение, ВидДв, Сумма)

	Запись = Движения.ПрочиеАктивыПассивы.Добавить();
	Запись.Период        = Дата;
	Запись.ВидДвижения   = ВидДв;
	Запись.Организация   = Организация;
	Запись.Подразделение = Подразделение;
	Запись.Статья        = Статья;
	Если ЗначениеЗаполнено(ТипНалога) Тогда
		Запись.Аналитика = ТипНалога;
	КонецЕсли;
	Запись.Источник      = Перечисления.ИсточникиУправленческогоБаланса.ПустаяСсылка();
	Запись.ВидИсточника  = Перечисления.ВидыИсточниковДвижений.ПустаяСсылка();
	Запись.Сумма         = Сумма;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
